In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
path =r'C:\Users\aramaiah.ASUAD\Naresh_IT\MyDataScience\Data_Files\Visadataset.csv'
visa_df=pd.read_csv(path)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [9]:
visa_df['continent'] #series
visa_df.continent    #series
visa_df[['continent']] #df

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

In [ ]:
cols=['Continent','']

In [10]:
visa_df.values
# list of all the sample
#  list of all te observations 
# list of all the tuples

array([['EZYV01', 'Asia', 'High School', ..., 'Hour', 'Y', 'Denied'],
       ['EZYV02', 'Asia', "Master's", ..., 'Year', 'Y', 'Certified'],
       ['EZYV03', 'Asia', "Bachelor's", ..., 'Year', 'Y', 'Denied'],
       ...,
       ['EZYV25478', 'Asia', "Master's", ..., 'Year', 'N', 'Certified'],
       ['EZYV25479', 'Asia', "Master's", ..., 'Year', 'Y', 'Certified'],
       ['EZYV25480', 'Asia', "Bachelor's", ..., 'Year', 'Y', 'Certified']],
      dtype=object)

In [11]:
# if i give list === df
#  if i give df ====list

$continent$

In [14]:
l1=[1,2,3]
l2=['A','B','C']
l=[l1,l2]
l
pd.DataFrame(l)

   0  1  2
0  1  2  3
1  A  B  C

In [15]:
pd.DataFrame(l).values

array([[1, 2, 3],
       ['A', 'B', 'C']], dtype=object)

In [16]:
col=['continent']
visa_df[col]

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

$unique$

In [17]:
# how many unique labels are there
visa_df['continent'].unique()

array(['Asia', 'Africa', 'North America', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [18]:
# python basic logic 
l1=['A','A','B','C'] #['A','B','C']
set(l1)

{'A', 'B', 'C'}

In [19]:
set(visa_df['continent'].unique())

{'Africa', 'Asia', 'Europe', 'North America', 'Oceania', 'South America'}

$nunique$

In [ ]:
# number of unique elements

In [ ]:
in the continent column only 7 elements are repeated

In [21]:
visa_df['continent'].nunique()
# number of unique elements

6

**Q1)out of total observation how many asia observations are there?**

In [22]:
visa_df['continent']

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [26]:
visa_df['continent'].nunique('Asia')
# number of unique elements

6

In [29]:
con=visa_df['continent']=='Asia'#true or false
len(visa_df[con])

16861

In [31]:
con1=visa_df['continent']=='Africa'#true or false
len(visa_df[con1])

551

In [33]:
unique_labels=visa_df['continent'].unique()

for i in unique_labels:

    con1=visa_df['continent']==i#true or false
    print(i,':', len(visa_df[con1]))

Asia : 16861
Africa : 551
North America : 3292
Europe : 3732
South America : 852
Oceania : 192

In [36]:
unique_labels=visa_df['continent'].unique()
count=[]
for i in unique_labels:

    con1=visa_df['continent']==i#true or false
    count.append( len(visa_df[con1]))
    
count

[16861, 551, 3292, 3732, 852, 192]

In [41]:
unique_labels=visa_df['continent'].unique()
count=[]
for i in unique_labels:

    con1=visa_df['continent']==i#true or false
    count.append( len(visa_df[con1]))
    
continent_df = pd.DataFrame(zip(unique_labels,count),columns=['Continent','Count'])
continent_df.to_csv('continent_df.csv',index=False)

In [ ]:
visa_df #Total data frame
visa_df['continent'] # Specific coulmn 
visa_df['continent']==

$value-counts$

In [43]:
continent_vc=visa_df['continent'].value_counts()
continent_vc

continent
Asia             16861
Europe            3732
North America     3292
South America      852
Africa             551
Oceania            192
Name: count, dtype: int64

In [ ]:
visa_df
visa_df['continent']
visa_df['continent'].unique()
visa_df['continent'].nunique()
visa_df['continent'].value_counts()

In [44]:
continent_vc.values

array([16861,  3732,  3292,   852,   551,   192], dtype=int64)

In [51]:
continent_vc=visa_df['continent'].value_counts()#series
l1=continent_vc.keys()
l2=continent_vc.values
pd.DataFrame(zip(l1,l2),coulmn=['continent','count'])
continent_vc_df

TypeError: DataFrame.__init__() got an unexpected keyword argument 'coulmn'

##Bar Chart##

- in order to draw a bar chart 
- we require one categrical column 
- and one numerical column 
- the package we are using here is matplotlib 
- the data frame we are using here is : continent_vc_df

In [49]:
# plt.bar(<cat>,<numer>,<data>)
continent_vc_df

NameError: name 'continent_vc_df' is not defined

In [52]:
plt.bar('continent',"count",data=continent_vc_df)

NameError: name 'continent_vc_df' is not defined

In [ ]:
- we read the data
- we read categorical coulmn 
- weplot the bar using